#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`
<details><summary>Show Plan</summary>
```

terraform
Running plan in Terraform Cloud. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/smile-web-system/gh-actions-smile/runs/run-pj7tfboen3udpkU5

Waiting for the plan to start...

Terraform v1.2.2
on linux_amd64
Initializing plugins and modules...
data.archive_file.lambda_zip: Reading...
aws_iam_role.lambda_exec: Refreshing state... [id=serverless_lambda]
aws_s3_bucket.lambda_bucket: Refreshing state... [id=car-smile-go]
data.archive_file.lambda_zip: Read complete after 1s [id=19d2de674cc8a7e194474b47eff6ac1035926cd3]
aws_s3_object.lambda_car_smile: Refreshing state... [id=golambda.zip]
aws_s3_bucket_acl.access_control_list: Refreshing state... [id=car-smile-go,private]
aws_iam_role_policy_attachment.lambda_policy: Refreshing state... [id=serverless_lambda-20220823025139878400000001]
aws_lambda_function.car-smile-mngr: Refreshing state... [id=car-smile-mngr-go]
aws_cloudwatch_log_group.car-smile-mngr: Refreshing state... [id=/aws/lambda/car-smile-mngr-go]
aws_api_gateway_rest_api.rest_api_car: Refreshing state... [id=rotvbk2bz9]
aws_api_gateway_deployment.rest_api_car_deploy: Refreshing state... [id=d9p8qk]
aws_lambda_permission.api-gateway-invoke-lambda: Refreshing state... [id=AllowAPIGatewayInvoke]
aws_api_gateway_stage.example: Refreshing state... [id=ags-rotvbk2bz9-dev]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
+/- create replacement and then destroy
 <= read (data resources)

Terraform will perform the following actions:

  # data.template_file.specification will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "template_file" "specification" {
      + id       = (known after apply)
      + rendered = (known after apply)
      + template = jsonencode(
            {
              + components = {
                  + schemas = {
                      + CarClaim   = {
                          + properties = {
                              + Company      = {
                                  + type = "string"
                                }
                              + Date         = {
                                  + type = "string"
                                }
                              + NumberClaim  = {
                                  + type = "string"
                                }
                              + NumberPolicy = {
                                  + type = "string"
                                }
                              + Shelters     = {
                                  + items = {
                                      + "$ref" = "#/components/schemas/CarShelter"
                                    }
                                  + type  = "array"
                                }
                            }
                          + type       = "object"
                        }
                      + CarGuia    = {
                          + properties = {
                              + ActualValue = {
                                  + format = "float"
                                  + type   = "number"
                                }
                              + Brand       = {
                                  + type = "string"
                                }
                              + Class       = {
                                  + type = "string"
                                }
                              + Country     = {
                                  + type = "string"
                                }
                              + Maker       = {
                                  + type = "string"
                                }
                              + Model       = {
                                  + type = "string"
                                }
                              + Type        = {
                                  + type = "string"
                                }
                            }
                          + type       = "object"
                        }
                      + CarHistory = {
                          + properties = {
                              + Active         = {
                                  + type = "string"
                                }
                              + Beneficiary    = {
                                  + type = "string"
                                }
                              + Chassis        = {
                                  + type = "string"
                                }
                              + CodeCompany    = {
                                  + type = "string"
                                }
                              + DateFin        = {
                                  + type = "string"
                                }
                              + DateIni        = {
                                  + type = "string"
                                }
                              + Engine         = {
                                  + type = "string"
                                }
                              + InsuredAmount  = {
                                  + type = "string"
                                }
                              + LicensePlate   = {
                                  + type = "string"
                                }
                              + NameCompany    = {
                                  + type = "string"
                                }
                              + PolicyHolder   = {
                                  + type = "string"
                                }
                              + PolicyHolderId = {
                                  + type = "string"
                                }
                              + PolicyNumber   = {
                                  + type = "string"
                                }
                              + Service        = {
                                  + type = "string"
                                }
                            }
                          + type       = "object"
                        }
                      + CarInfo    = {
                          + properties = {
                              + Claims       = {
                                  + items = {
                                      + "$ref" = "#/components/schemas/CarClaim"
                                    }
                                  + type  = "array"
                                }
                              + Guia         = {
                                  + "$ref" = "#/components/schemas/CarGuia"
                                }
                              + History      = {
                                  + items = {
                                      + "$ref" = "#/components/schemas/CarHistory"
                                    }
                                  + type  = "array"
                                }
                              + LicensePlate = {
                                  + type = "string"
                                }
                              + Owners       = {
                                  + items = {
                                      + "$ref" = "#/components/schemas/CarOwner"
                                    }
                                  + type  = "array"
                                }
                              + Score        = {
                                  + "$ref" = "#/components/schemas/CarScore"
                                }
                              + Simis        = {
                                  + items = {
                                      + "$ref" = "#/components/schemas/CarSimi"
                                    }
                                  + type  = "array"
                                }
                            }
                          + required   = [
                              + "LicensePlate",
                            ]
                          + type       = "object"
                        }
                      + CarOwner   = {
                          + properties = {
                              + Id   = {
                                  + type = "string"
                                }
                              + Name = {
                                  + type = "string"
                                }
                            }
                          + type       = "object"
                        }
                      + CarScore   = {
                          + properties = {
                              + ScoreClaims     = {
                                  + format = "float"
                                  + type   = "number"
                                }
                              + ScoreCloseSimis = {
                                  + format = "float"
                                  + type   = "number"
                                }
                              + ScoreOpenSimis  = {
                                  + format = "float"
                                  + type   = "number"
                                }
                              + ScoreOwners     = {
                                  + format = "float"
                                  + type   = "number"
                                }
                              + ScoreTotal      = {
                                  + format = "float"
                                  + type   = "number"
                                }
                            }
                          + type       = "object"
                        }
                      + CarShelter = {
                          + properties = {
                              + AmountPaid      = {
                                  + type = "string"
                                }
                              + Date            = {
                                  + type = "string"
                                }
                              + Name            = {
                                  + type = "string"
                                }
                              + ReclaimedAmount = {
                                  + format = "float"
                                  + type   = "number"
                                }
                              + Status          = {
                                  + type = "string"
                                }
                            }
                          + type       = "object"
                        }
                      + CarSimi    = {
                          + properties = {
                              + Code   = {
                                  + type = "string"
                                }
                              + Date   = {
                                  + type = "string"
                                }
                              + Name   = {
                                  + type = "string"
                                }
                              + Number = {
                                  + type = "string"
                                }
                              + Status = {
                                  + type = "string"
                                }
                              + Value  = {
                                  + type = "string"
                                }
                            }
                          + type       = "object"
                        }
                    }
                }
              + info       = {
                  + title   = "car-smile-api"
                  + version = "1.0.0"
                }
              + openapi    = "3.0.1"
              + paths      = {
                  + "/smile/v2/car/version"        = {
                      + get = {
                          + responses                       = {
                              + "200" = {
                                  + content     = {
                                      + "application/json" = {}
                                    }
                                  + description = "version app"
                                }
                            }
                          + x-amazon-apigateway-integration = {
                              + contentHandling     = "CONVERT_TO_TEXT"
                              + httpMethod          = "GET"
                              + passthroughBehavior = "when_no_match"
                              + responses           = {
                                  + default = {
                                      + statusCode = "200"
                                    }
                                }
                              + type                = "aws_proxy"
                              + uri                 = "arn:aws:apigateway:${aws_region}:lambda:path/2015-03-31/functions/${lambda_identity_arn}/invocations"
                            }
                        }
                    }
                  + "/smile/v2/car/{licensePlate}" = {
                      + get = {
                          + parameters                      = [
                              + {
                                  + in       = "path"
                                  + name     = "licensePlate"
                                  + required = true
                                  + schema   = {
                                      + type = "string"
                                    }
                                },
                            ]
                          + responses                       = {
                              + "200" = {
                                  + content     = {
                                      + "application/json" = {
                                          + schema = {
                                              + "$ref" = "#/components/schemas/CarInfo"
                                            }
                                        }
                                    }
                                  + description = "200 response"
                                }
                            }
                          + x-amazon-apigateway-integration = {
                              + contentHandling     = "CONVERT_TO_TEXT"
                              + httpMethod          = "POST"
                              + passthroughBehavior = "when_no_match"
                              + responses           = {
                                  + default = {
                                      + statusCode = "200"
                                    }
                                }
                              + type                = "aws_proxy"
                              + uri                 = "arn:aws:apigateway:${aws_region}:lambda:path/2015-03-31/functions/${lambda_identity_arn}/invocations"
                            }
                        }
                    }
                }
              + servers    = [
                  + {
                      + url       = "https://k5o9nsfxcf.execute-api.us-east-1.amazonaws.com/{basePath}"
                      + variables = {
                          + basePath = {
                              + default = "/dev"
                            }
                        }
                    },
                ]
            }
        )
      + vars     = {
          + "aws_region"          = "us-east-1"
          + "lambda_identity_arn" = "arn:aws:lambda:us-east-1:225716232501:function:car-smile-mngr-go"
        }
    }

  # aws_api_gateway_deployment.rest_api_car_deploy must be replaced
+/- resource "aws_api_gateway_deployment" "rest_api_car_deploy" {
      ~ created_date  = "2022-08-23T02:52:03Z" -> (known after apply)
      ~ execution_arn = "arn:aws:execute-api:us-east-1:225716232501:rotvbk2bz9/" -> (known after apply)
      ~ id            = "d9p8qk" -> (known after apply)
      ~ invoke_url    = "https://rotvbk2bz9.execute-api.us-east-1.amazonaws.com/" -> (known after apply)
      ~ triggers      = {
          - "redeployment" = "f38a93d6ad868c5800895b732c580600abac8b4a"
        } -> (known after apply) # forces replacement
        # (1 unchanged attribute hidden)
    }

  # aws_api_gateway_rest_api.rest_api_car will be updated in-place
  ~ resource "aws_api_gateway_rest_api" "rest_api_car" {
      ~ body                         = jsonencode(
            {
              - components = {
                  - schemas = {
                      - CarClaim   = {
                          - properties = {
                              - Company      = {
                                  - type = "string"
                                }
                              - Date         = {
                                  - type = "string"
                                }
                              - NumberClaim  = {
                                  - type = "string"
                                }
                              - NumberPolicy = {
                                  - type = "string"
                                }
                              - Shelters     = {
                                  - items = {
                                      - "$ref" = "#/components/schemas/CarShelter"
                                    }
                                  - type  = "array"
                                }
                            }
                          - type       = "object"
                        }
                      - CarGuia    = {
                          - properties = {
                              - ActualValue = {
                                  - format = "float"
                                  - type   = "number"
                                }
                              - Brand       = {
                                  - type = "string"
                                }
                              - Class       = {
                                  - type = "string"
                                }
                              - Country     = {
                                  - type = "string"
                                }
                              - Maker       = {
                                  - type = "string"
                                }
                              - Model       = {
                                  - type = "string"
                                }
                              - Type        = {
                                  - type = "string"
                                }
                            }
                          - type       = "object"
                        }
                      - CarHistory = {
                          - properties = {
                              - Active         = {
                                  - type = "string"
                                }
                              - Beneficiary    = {
                                  - type = "string"
                                }
                              - Chassis        = {
                                  - type = "string"
                                }
                              - CodeCompany    = {
                                  - type = "string"
                                }
                              - DateFin        = {
                                  - type = "string"
                                }
                              - DateIni        = {
                                  - type = "string"
                                }
                              - Engine         = {
                                  - type = "string"
                                }
                              - InsuredAmount  = {
                                  - type = "string"
                                }
                              - LicensePlate   = {
                                  - type = "string"
                                }
                              - NameCompany    = {
                                  - type = "string"
                                }
                              - PolicyHolder   = {
                                  - type = "string"
                                }
                              - PolicyHolderId = {
                                  - type = "string"
                                }
                              - PolicyNumber   = {
                                  - type = "string"
                                }
                              - Service        = {
                                  - type = "string"
                                }
                            }
                          - type       = "object"
                        }
                      - CarInfo    = {
                          - properties = {
                              - Claims       = {
                                  - items = {
                                      - "$ref" = "#/components/schemas/CarClaim"
                                    }
                                  - type  = "array"
                                }
                              - Guia         = {
                                  - "$ref" = "#/components/schemas/CarGuia"
                                }
                              - History      = {
                                  - items = {
                                      - "$ref" = "#/components/schemas/CarHistory"
                                    }
                                  - type  = "array"
                                }
                              - LicensePlate = {
                                  - type = "string"
                                }
                              - Owners       = {
                                  - items = {
                                      - "$ref" = "#/components/schemas/CarOwner"
                                    }
                                  - type  = "array"
                                }
                              - Score        = {
                                  - "$ref" = "#/components/schemas/CarScore"
                                }
                              - Simis        = {
                                  - items = {
                                      - "$ref" = "#/components/schemas/CarSimi"
                                    }
                                  - type  = "array"
                                }
                            }
                          - required   = [
                              - "LicensePlate",
                            ]
                          - type       = "object"
                        }
                      - CarOwner   = {
                          - properties = {
                              - Id   = {
                                  - type = "string"
                                }
                              - Name = {
                                  - type = "string"
                                }
                            }
                          - type       = "object"
                        }
                      - CarScore   = {
                          - properties = {
                              - ScoreClaims     = {
                                  - format = "float"
                                  - type   = "number"
                                }
                              - ScoreCloseSimis = {
                                  - format = "float"
                                  - type   = "number"
                                }
                              - ScoreOpenSimis  = {
                                  - format = "float"
                                  - type   = "number"
                                }
                              - ScoreOwners     = {
                                  - format = "float"
                                  - type   = "number"
                                }
                              - ScoreTotal      = {
                                  - format = "float"
                                  - type   = "number"
                                }
                            }
                          - type       = "object"
                        }
                      - CarShelter = {
                          - properties = {
                              - AmountPaid      = {
                                  - type = "string"
                                }
                              - Date            = {
                                  - type = "string"
                                }
                              - Name            = {
                                  - type = "string"
                                }
                              - ReclaimedAmount = {
                                  - format = "float"
                                  - type   = "number"
                                }
                              - Status          = {
                                  - type = "string"
                                }
                            }
                          - type       = "object"
                        }
                      - CarSimi    = {
                          - properties = {
                              - Code   = {
                                  - type = "string"
                                }
                              - Date   = {
                                  - type = "string"
                                }
                              - Name   = {
                                  - type = "string"
                                }
                              - Number = {
                                  - type = "string"
                                }
                              - Status = {
                                  - type = "string"
                                }
                              - Value  = {
                                  - type = "string"
                                }
                            }
                          - type       = "object"
                        }
                    }
                }
              - info       = {
                  - title   = "car-smile-api"
                  - version = "1.0.0"
                }
              - openapi    = "3.0.1"
              - paths      = {
                  - "/smile/v2/car/{licensePlate}" = {
                      - get = {
                          - parameters                      = [
                              - {
                                  - in       = "path"
                                  - name     = "licensePlate"
                                  - required = true
                                  - schema   = {
                                      - type = "string"
                                    }
                                },
                            ]
                          - responses                       = {
                              - "200" = {
                                  - content     = {
                                      - "application/json" = {
                                          - schema = {
                                              - "$ref" = "#/components/schemas/CarInfo"
                                            }
                                        }
                                    }
                                  - description = "200 response"
                                }
                            }
                          - x-amazon-apigateway-integration = {
                              - contentHandling     = "CONVERT_TO_TEXT"
                              - httpMethod          = "POST"
                              - passthroughBehavior = "when_no_match"
                              - responses           = {
                                  - default = {
                                      - statusCode = "200"
                                    }
                                }
                              - type                = "aws_proxy"
                              - uri                 = "arn:aws:apigateway:us-east-1:lambda:path/2015-03-31/functions/arn:aws:lambda:us-east-1:225716232501:function:car-smile-mngr-go/invocations"
                            }
                        }
                    }
                }
              - servers    = [
                  - {
                      - url       = "https://k5o9nsfxcf.execute-api.us-east-1.amazonaws.com/{basePath}"
                      - variables = {
                          - basePath = {
                              - default = "/dev"
                            }
                        }
                    },
                ]
            }
        ) -> (known after apply)
        id                           = "rotvbk2bz9"
        name                         = "car-smile-api"
        tags                         = {}
        # (9 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # aws_api_gateway_stage.example will be updated in-place
  ~ resource "aws_api_gateway_stage" "example" {
      ~ deployment_id         = "d9p8qk" -> (known after apply)
        id                    = "ags-rotvbk2bz9-dev"
        tags                  = {}
        # (9 unchanged attributes hidden)
    }

  # aws_lambda_function.car-smile-mngr will be updated in-place
  ~ resource "aws_lambda_function" "car-smile-mngr" {
        id                             = "car-smile-mngr-go"
      ~ last_modified                  = "2022-08-23T02:52:03.119+0000" -> (known after apply)
      ~ source_code_hash               = "PamtShgukKkh0nNnU7Jx3WqfUQ2ZT6MEC3MVlcOBoTw=" -> "CN3QnFy3yzk7F1zYYIoiDhtP66XlhUjlXFeIrKZbbZQ="
        tags                           = {}
        # (19 unchanged attributes hidden)


        # (2 unchanged blocks hidden)
    }

  # aws_s3_object.lambda_car_smile will be updated in-place
  ~ resource "aws_s3_object" "lambda_car_smile" {
      ~ etag               = "8e06f08b4eb2b5c1050c6d2720609bb4" -> "8cb7c3dbbe6b7cdefcd43f876e11e63d"
        id                 = "golambda.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

Plan: 1 to add, 4 to change, 1 to destroy.

Changes to Outputs:
  ~ base_url = "https://rotvbk2bz9.execute-api.us-east-1.amazonaws.com/" -> (known after apply)

```
</details>
*Pusher: @leonfloch, Action: `pull_request`*